IdeaRS.Connections
ConnectionData Class
Compatible with IDEA StatiCa 0.0
 Represents the data contract of the connection (the manufacturing sequence and connection parameters)
Inheritance Hierarchy
Object
 IdeaRS.Connections.Data.ConnectionData
 Namespace: IdeaRS.Connections.Data
 Assembly: IdeaRS.Connections (in IdeaRS.Connections.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class ConnectionData
The ConnectionData type exposes the following members.
Constructors
Name | Description
ConnectionData
Initializes a new instance of the ConnectionData class
Top
Properties
Name | Description
BeamProperties
 Gets or sets the properties of the cennected beams
BeamSequence
 Gets or sets the manufacturing sequence
NodeId
 Gets or sets the Id of the corresponding node in the structure
Properties
 Gets or sets the properties of the connection
Sequence
 Gets or sets the manufacturing sequence
Top
Methods
Name | Description
AddBeam(Guid, ConnectionCmdData)
AddBeam(Int32, Guid, ConnectionCmdData)
AddOperation(Guid, ConnectionCmdData)
AddOperation(Int32, Guid, ConnectionCmdData)
Equals
Determines whether the specified object is equal to the current object.
 (Inherited from Object.)
Finalize
Allows an object to try to free resources and perform other cleanup operations before it is reclaimed by garbage collection.
 (Inherited from Object.)
GetHashCode
Serves as the default hash function.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
MemberwiseClone
Creates a shallow copy of the current Object.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Top
See Also
Reference
IdeaRS.Connections.Data Namespace